---
type: LightDistribution
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 3
tags: [revit-api, class]
---

# LightDistribution

`Autodesk.Revit.DB.Lighting.LightDistribution` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Clone | 2013 | `public LightDistribution Clone ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |